Tekla Open API Reference for Tekla Structures 2025
Detail Properties
The Detail type exposes the following members.
Properties
Name | Description
AutoDirectionType
 The auto direction type. Default value is AUTODIR_DETAIL. Value should be AUTODIR_NA to set direction with UpVector property. Value should be AUTODIR_FROM_ATTRIBUTE_FILE to set direction with detail attribute file.
Class
 The class of the detail.
Code
 The code of the detail. The code can be used to classify the detail. The code can be reported and shown in drawings. The maximum length of the string is 20 characters.
DetailType
 The detail type.
Identifier
 The identifier of the object.
 (Inherited from Object.)
IsUpToDate
Gets if the object does not have a modification which is not shared.
 (Inherited from ModelObject.)
ModificationTime
Gets latest time of the object was modified or created.
 (Inherited from ModelObject.)
Name
 The name of the component. The name identifies custom components or plug-ins.
 (Inherited from BaseComponent.)
Number
 The number of the component. A number greater than zero identifies system components, for custom components the number is CUSTOM_OBJECT_NUMBER, and for plug-ins the number is PLUGIN_OBJECT_NUMBER.
 (Inherited from BaseComponent.)
PositionType
 The position type.
Status
 The read only status of the detail. The status can be reported and shown in drawings. The color of the detail symbol in the model indicates the status of the detail.
UpVector
 A vector indicating which direction is considered the up direction.
Top
See Also
Reference
Detail Class
Tekla.Structures.Model Namespace